## production: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-09-21T13:43:13Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:820252213580:2aluui7fbb/" -> (known after apply)
      ~ id            = "h0sxar" -> (known after apply)
      ~ invoke_url    = "https://2aluui7fbb.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-09-21T13:43:12Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "h0sxar" -> (known after apply)
        id                    = "ags-2aluui7fbb-production"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.metrics_collection will be updated in-place
  ~ resource "aws_wafv2_web_acl" "metrics_collection" {
        id          = "2f8c89fb-c923-4d2b-91c0-48d3d183162b"
        name        = "metrics_collection1"
        tags        = {}
        # (6 unchanged attributes hidden)


      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"

                  + excluded_rule {
                      + name = "SizeRestrictions_BODY"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 2 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://2aluui7fbb.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>